sample-xml-soap/customer-truncated-soap-response.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://www.w3.org/2005/xpath-functions"><SOAP-ENV:Header/><SOAP-ENV:Body><C_MKTSEGMENT_ROLLUP xmlns=""><C_MKTSEGMENT_SUMMARY><C_MKTSEGMENT>AUTOMOBILE</C_MKTSEGMENT><C_ACCTBAL_TOTAL>75577498.12</C_ACCTBAL_TOTAL><C_ACCTBAL_TREND>DECLINING</C_ACCTBAL_TREND><C_NATIONKEYS><C_NATIONKEY>1</C_NATIONKEY><C_NATIONKEY>2</C_NATIONKEY></C_NATIONKEYS></C_MKTSEGMENT_SUMMARY><C_MKTSEGMENT_SUMMARY><C_MKTSEGMENT>MACHINERY</C_MKTSEGMENT><C_ACCTBAL_TOTAL>5544522866.83</C_ACCTBAL_TOTAL><C_ACCTBAL_TREND>INCREASING</C_ACCTBAL_TREND><C_NATIONKEYS><C_NATIONKEY>4</C_NATIONKEY><C_NATIONKEY>2</C_NATIONKEY></C_NATIONKEYS></C_MKTSEGMENT_SUMMARY></C_MKTSEGMENT_ROLLUP></SOAP-ENV:Body></SOAP-ENV:Envelope>
